<?php
	include_once "includes/hea.php";
	echo "Про меня - TemaSaur";
	include_once "includes/der.php";
	include_once "includes/page_top.php";
?>

		<div class="ts-txt-wrap">
			<h1 class="ts-hand ts-shadow">Про меня</h1>
			<div class="ts-dark">
				<p>
					Как вы уже знаете, меня зовут Артемий и я программист-самоучка.
				</p>
				<p>
					Я всегда любил математику и сложные задачи.
					В школе не пропускал ни одной математической олимпиады.
					В один день на уроке информатики учитель познакомил нас с программированием.
					В рамках школьной программы изучается Pascal.
					Решая простые задчи, я понял что это мне близко.
					И, поскольку в школе не было дополнительных занятий по кодингу, я решил изучать эту тему самостоятельно.
					Начал с видео-уроков на <a href="https://youtube.com" class="link">YouTube</a> по языку Python.
					Для закрепления решал задачи с <a href="https://euler.jakumo.org/" class="link">проекта Эйлера</a>.
				</p>
				<p>
					Моим первым учебным проектом стал <a href="" class="link">консольный (текстовый) симулятор детской игры "козел"</a>.
					Всего за два месяца летних каникул я научился создавать алгоритмы и в учебном году стал призером Муниципального этапа Всероссийской Олимпиады Школьников.
				</p>
				<p>
					Но я не остановился на этом... Мне стало интересно, какой продукт я смогу разработать сам.
					Узнал, как можно строить сайты на HTML и попробовал сделать <a href="projects#first" class="link">свой первый сайт для школьного проекта</a> (на чистом HTML4).
					Хоть я и использовал устаревшие технологии, и получил соответствующий результат, для первого раза вышло, я считаю, неплохо 😃. 
				</p>
				<p>
					После я читал книги про алгоитмы и структуры данных, изучал Java, C++.
					Тогда же начал учавствовать в контестах по спортивному программированию на <a href="https://codeforces.com" class="link">CodeForces</a>.
					Пробовал геймдев на Unity с C#, но скоро потерял к этому интерес.
					Параллельно я развивался в веб-разработке, изучил HTML5, CSS3 (+Sass), JavaScript (+jQuery, ReactJS, NodeJS), PHP.
				</p>
				<p>
					На сегодняшний день я продолжаю развиваться и учиться, ищу проекты.
					Сейчас моя главная цель - получить работу разработчика ПО, чтобы набраться опыта и пополнить портфолио.
				</p>
			</div>
		</div>

		<section class="ts-footer-planet" id="about-footer-planet">
			<?php include "../svg/rocket_1.svg" ?>
		</section>
	</main>
</body>
</html>